{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "signature": {"inputs": {"X": {"name": "X:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"Accuracy/Prediction": {"name": "Accuracy/Prediction:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "Dropout_Layer/GreaterEqual/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "Hidden_1/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Hidden_1/b", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "Dropout_Layer/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Dropout_Layer/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "Hidden_2/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}}}, {"name": "Hidden_2/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Output/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}}}, {"name": "Output/b", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "Accuracy/Prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Hidden_1/MatMul", "op": "MatMul", "input": ["X", "Hidden_1/w"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Hidden_1/add", "op": "AddV2", "input": ["Hidden_1/MatMul", "Hidden_1/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Hidden_1/Relu", "op": "Relu", "input": ["Hidden_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Dropout_Layer/Shape", "op": "Shape", "input": ["Hidden_1/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "Dropout_Layer/Mul", "op": "Mul", "input": ["Hidden_1/Relu", "Dropout_Layer/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Dropout_Layer/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["Dropout_Layer/Shape"], "attr": {"T": {"type": "DT_INT32"}, "seed": {"i": "404"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "0"}}}, {"name": "Dropout_Layer/GreaterEqual", "op": "GreaterEqual", "input": ["Dropout_Layer/random_uniform/RandomUniform", "Dropout_Layer/GreaterEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Dropout_Layer/SelectV2", "op": "SelectV2", "input": ["Dropout_Layer/GreaterEqual", "Dropout_Layer/Mul", "Dropout_Layer/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Hidden_2/MatMul", "op": "MatMul", "input": ["Dropout_Layer/SelectV2", "Hidden_2/w"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "Hidden_2/add", "op": "AddV2", "input": ["Hidden_2/MatMul", "Hidden_2/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Hidden_2/Relu", "op": "Relu", "input": ["Hidden_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Output/MatMul", "op": "MatMul", "input": ["Hidden_2/Relu", "Output/w"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Output/add", "op": "AddV2", "input": ["Output/MatMul", "Output/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Output/Softmax", "op": "Softmax", "input": ["Output/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Accuracy/Prediction", "op": "ArgMax", "input": ["Output/Softmax", "Accuracy/Prediction/dimension"], "attr": {"T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}}}], "library": {}, "versions": {"producer": 1395}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Dropout_Layer/GreaterEqual/y", "shape": [], "dtype": "float32"}, {"name": "Hidden_1/w", "shape": [784, 512], "dtype": "float32"}, {"name": "Hidden_1/b", "shape": [512], "dtype": "float32"}, {"name": "Dropout_Layer/Const", "shape": [], "dtype": "float32"}, {"name": "Dropout_Layer/Const_1", "shape": [], "dtype": "float32"}, {"name": "Hidden_2/w", "shape": [512, 64], "dtype": "float32"}, {"name": "Hidden_2/b", "shape": [64], "dtype": "float32"}, {"name": "Output/w", "shape": [64, 10], "dtype": "float32"}, {"name": "Output/b", "shape": [10], "dtype": "float32"}, {"name": "Accuracy/Prediction/dimension", "shape": [], "dtype": "int32"}]}]}